backend/app/controllers/order_items_controller.rb

  def index
    @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

  def create
    @order_item = OrderItem.new(order_item_params)

    if @order_item.save
---
INSERT INTO "order_items" ("item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["item_id", nil], ["quantity", 1], ["created_at", "2023-12-18 03:13:33.797618"], ["updated_at", "2023-12-18 03:13:33.797618"]]

  def update
    if @order_item.update(order_item_params)
---
UPDATE "order_items" SET "item_id" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["item_id", "Mario"], ["updated_at", "2023-12-18 04:05:49.245094"], ["id", 6]]

  def destroy
    @order_item.destroy!
---
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 1]]

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]