backend/app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    if @order.save
---
INSERT INTO "orders" ("status", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["status", "Pending"], ["created_at", "2023-12-18 03:45:10.944861"], ["updated_at", "2023-12-18 03:45:10.944861"]]

  def update
    if @order.update(order_params)
---
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "Completed"], ["updated_at", "2023-12-18 03:47:34.979911"], ["id", 1]]

  def destroy
    @order.destroy!
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]