backend/app/controllers/video_games_controller.rb

  def index
    @video_games = VideoGame.all
---
SELECT "video_games".* FROM "video_games"

  def create
    @video_game = VideoGame.new(video_game_params)

    if @video_game.save
---
INSERT INTO "video_games" ("name", "price", "quantity", "console", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Sonic"], ["price", 70], ["quantity", 3], ["console", "DS"], ["rating", 5.0], ["created_at", "2023-12-18 02:36:19.488669"], ["updated_at", "2023-12-18 02:36:19.488669"]]

  def update
    if @video_game.update(video_game_params)
---
UPDATE "video_games" SET "price" = ?, "updated_at" = ? WHERE "video_games"."id" = ?  [["price", 50], ["updated_at", "2023-12-20 00:34:44.947868"], ["id", 1]]

  def destroy
    @video_game.destroy!
---
DELETE FROM "video_games" WHERE "video_games"."id" = ?  [["id", 2]]

    def set_video_game
      @video_game = VideoGame.find(params[:id])
---
SELECT "video_games".* FROM "video_games" WHERE "video_games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]